app/models/shortened_url.rb

    def self.random_code
        currentURL = SecureRandom.urlsafe_base64
        while ShortenedUrl.exists?(:short_url => currentURL)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "I1aMTLU6eHTONe4T0sDtMw"], ["LIMIT", 1]]

    def self.create_for_user_and_long_url!(user, long_url)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "heshamooo"], ["short_url", "I1aMTLU6eHTONe4T0sDtMw"], ["user_id", 15], ["created_at", "2020-09-28 03:53:28.341496"], ["updated_at", "2020-09-28 03:53:28.341496"]]