app/models/visit.rb

INSERT INTO "visits" ("visitor_id", "visited_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["visitor_id", 21], ["visited_url", 4], ["created_at", "2020-09-28 04:05:25.737306"], ["updated_at", "2020-09-28 04:05:25.737306"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(
      shortened_url_id: shortened_url.id,
      visitor_id: user.id
    )